src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиAPI</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_HTTPМетодAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_СпособПолученияДанныхAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМетодаОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторТипИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ТипИсточникаКонструктораAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторВиртуальнаяТаблица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторПараметрПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторОтборыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОтвета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ФорматОтветаAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JSONПараметрыЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСопоставления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МС_СпособСопоставленияПараметраОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТестовыеЗначенияПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиAPI/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьСписокВыбораСравненияОтбора();
	ЗаполнитьСписокВыбораФорматаПоля();
	ЗаполнитьСпискиВыбораПараметровЗаписиJSON();

	// Существующий элемент заполняется в ПриЧтенииНаСервере, который вызывается раньше.
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьФормуПоОбъекту();
	КонецЕсли;

	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// Вызывается при открытии существующего элемента и при повторном чтении после записи.
	ЗаполнитьФормуПоОбъекту();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ТекущийОбъект.ФорматОтвета = Перечисления.МС_ФорматОтветаAPI.JSON Тогда
		НастройкиЗаписиJSON = НастройкиЗаписиJSONФормы();
		ТекущийОбъект.JSONПараметрыЗаписи = МС_HTTPAPIСервер.СтрокаНастроекЗаписиJSONИзСтруктурыФормы(НастройкиЗаписиJSON);
	КонецЕсли;

	Способ = ТекущийОбъект.СпособПолученияДанных;
	Если Способ = Перечисления.МС_СпособПолученияДанныхAPI.Конструктор Тогда
		ТекстОшибки = МС_HTTPAPIКонструкторСервер.ОшибкаПолейКонструктора(ПоляКонструктора);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ПоляКонструктора", , Отказ);
			Возврат;
		КонецЕсли;
		ТекстОшибки = МС_HTTPAPIКонструкторСервер.ОшибкаВиртуальнойТаблицы(ТекущийОбъект);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.КонструкторПараметрПериода", , Отказ);
			Возврат;
		КонецЕсли;
		МС_HTTPAPIКонструкторСервер.ПрименитьМастерКонструкторуКОбъекту(ТекущийОбъект, ПоляКонструктора, ОтборыКонструктора);
		МС_HTTPAPIСервер.ЗаполнитьПараметрыЗапросаИзОтборовКонструктораПоJSON(ТекущийОбъект);
	КонецЕсли;

	Если Способ = Перечисления.МС_СпособПолученияДанныхAPI.ТекстЗапроса Тогда
		ТекстОшибки = МС_HTTPAPIСервер.ОшибкаСоответствияПараметровИТекстаЗапроса(
			ТекущийОбъект.ТекстЗапроса, ТекущийОбъект.ПараметрыЗапроса);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.ПараметрыЗапроса", , Отказ);
		КонецЕсли;
	КонецЕсли;

	МС_HTTPAPIСервер.СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(ТекущийОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура HTTPМетодПриИзменении(Элемент)

	ОбновитьИтоговыйАдресAPI(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ВерсияAPIПриИзменении(Элемент)

	ОбновитьИтоговыйАдресAPI(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПараметрURLПриИзменении(Элемент)

	ОбновитьИтоговыйАдресAPI(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаПриИзменении(Элемент)

	ОбновитьИтоговыйАдресAPI(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ТестовыеЗначенияПараметровПриИзменении(Элемент)

	ОбновитьИтоговыйАдресAPI(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СпособПолученияДанныхПриИзменении(Элемент)

	СпособПолученияДанныхПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура СпособПолученияДанныхПриИзмененииНаСервере()

	ЗаполнитьПараметрыAPIИзОтборовКонструктора();
	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ФорматОтветаПриИзменении(Элемент)

	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура КонструкторТипИсточникаПриИзменении(Элемент)

	КонструкторТипИсточникаПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура КонструкторТипИсточникаПриИзмененииНаСервере()

	Объект.КонструкторИмяОбъекта = "";
	Объект.КонструкторИмяТабличнойЧасти = "";
	ОбновитьМастерКонструктора();

КонецПроцедуры

&НаКлиенте
Процедура КонструкторИмяОбъектаПриИзменении(Элемент)

	КонструкторИмяОбъектаПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура КонструкторИмяОбъектаПриИзмененииНаСервере()

	Объект.КонструкторИмяТабличнойЧасти = "";
	ОбновитьМастерКонструктора();

КонецПроцедуры

&НаКлиенте
Процедура КонструкторИмяТабличнойЧастиПриИзменении(Элемент)

	КонструкторИмяТабличнойЧастиПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура КонструкторИмяТабличнойЧастиПриИзмененииНаСервере()

	ОбновитьМастерКонструктора();

КонецПроцедуры

&НаКлиенте
Процедура КонструкторВиртуальнаяТаблицаПриИзменении(Элемент)

	ПараметрыКонструктораПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура КонструкторПараметрПериодаПриИзменении(Элемент)

	ПараметрыКонструктораПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПараметрыКонструктораПриИзмененииНаСервере()

	ЗаполнитьПараметрыAPIИзОтборовКонструктора();
	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоляКонструктора

&НаКлиенте
Процедура ПоляКонструктораПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Включить = Истина;
		Элемент.ТекущиеДанные.Формат = "Представление";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоляКонструктораРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ПоляКонструктора.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Реквизиты = РеквизитыДляФорматаПоля(ПредпросмотрИмениТаблицы, ТекущиеДанные.ИмяПоля);
	Если Реквизиты.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Поле не является ссылкой на справочник, документ или план видов характеристик: "
			+ "реквизиты для него не выбираются.");
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	Оповещение = Новый ОписаниеОповещения("ПоляКонструктораРеквизитПослеВыбора", ЭтотОбъект, ДополнительныеПараметры);
	НачальноеЗначение = Реквизиты.НайтиПоЗначению(ТекущиеДанные.Реквизит);
	ПоказатьВыборИзСписка(Оповещение, Реквизиты, Элемент, НачальноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура ПоляКонструктораРеквизитПослеВыбора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаПоля = ПоляКонструктора.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если СтрокаПоля = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтрокаПоля.Реквизит = ВыбранныйЭлемент.Значение;
	СтрокаПоля.Формат = "Реквизит";
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборыКонструктора

&НаКлиенте
Процедура ОтборыКонструктораПриИзменении(Элемент)

	ОтборыКонструктораПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОтборыКонструктораПриИзмененииНаСервере()

	ЗаполнитьПараметрыAPIИзОтборовКонструктора();

КонецПроцедуры

&НаКлиенте
Процедура ОтборыКонструктораПолеПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ОтборыКонструктора.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ЗначениеКонстанты = "";
		ТекущиеДанные.ЗначениеВнутр = "";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборыКонструктораЗначениеКонстантыПриИзменении(Элемент)

	// Значение введено вручную - при записи оно будет приведено к типу поля.
	// Фиксированное значение важнее параметра, поэтому параметр строки очищается.
	ТекущиеДанные = Элементы.ОтборыКонструктора.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ЗначениеВнутр = "";
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗначениеКонстанты) Тогда
			ТекущиеДанные.ИмяПараметра = "";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборыКонструктораЗначениеКонстантыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ОтборыКонструктора.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Поле) Тогда
		ПоказатьПредупреждение(, "Сначала выберите поле отбора.");
		Возврат;
	КонецЕсли;

	// Один серверный вызов: тип поля определяется только по метаданным.
	ДанныеВвода = ДанныеВводаЗначенияОтбора(ПредпросмотрИмениТаблицы,
		ТекущиеДанные.Поле, ТекущиеДанные.ЗначениеВнутр, ТекущиеДанные.ЗначениеКонстанты);
	Если ДанныеВвода = Неопределено Тогда
		ПоказатьПредупреждение(, "Не удалось определить тип поля по метаданным. Введите значение вручную в ячейке.");
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	Оповещение = Новый ОписаниеОповещения("ОтборыКонструктораЗначениеКонстантыПослеВвода", ЭтотОбъект,
		ДополнительныеПараметры);
	ПоказатьВводЗначения(Оповещение, ДанныеВвода.НачальноеЗначение, "Значение отбора (фикс.)", ДанныеВвода.ОписаниеТипов);

КонецПроцедуры

&НаКлиенте
Процедура ОтборыКонструктораЗначениеКонстантыПослеВвода(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаОтбора = ОтборыКонструктора.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Если СтрокаОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеЗначения = ДанныеФиксированногоЗначенияОтбора(Результат);
	СтрокаОтбора.ЗначениеКонстанты = ДанныеЗначения.Представление;
	СтрокаОтбора.ЗначениеВнутр = ДанныеЗначения.ЗначениеВнутр;
	// Фиксированное значение важнее параметра: параметр строки очищается и уходит из "Параметров запроса".
	СтрокаОтбора.ИмяПараметра = "";
	Модифицированность = Истина;
	ОтборыКонструктораПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТестВыполнения(Команда)

	Если НастройкаЗаписана("Запишите элемент перед тестом: тест выполняется по сохраненной настройке.") Тогда
		РезультатПросмотра = ТестВыполненияНаСервере(Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьПример(Команда)

	Если НастройкаЗаписана("Запишите элемент перед формированием примера.") Тогда
		РезультатПросмотра = СформироватьПримерНаСервере(Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗаполнитьПоляИзМетаданных(Команда)

	КонструкторЗаполнитьПоляИзМетаданныхНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыИзТекстаЗапроса(Команда)

	СпособТекстЗапроса = ПредопределенноеЗначение("Перечисление.МС_СпособПолученияДанныхAPI.ТекстЗапроса");
	Если Объект.СпособПолученияДанных = СпособТекстЗапроса Тогда
		ЗаполнитьПараметрыИзТекстаЗапросаНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыИзОтборовКонструктора(Команда)

	Сообщение = ЗаполнитьПараметрыИзОтборовКонструктораНаСервере();
	Если ЗначениеЗаполнено(Сообщение) Тогда
		ПоказатьПредупреждение(, Сообщение);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеФормы

&НаСервере
Процедура ЗаполнитьФормуПоОбъекту()

	Если Не ЗначениеЗаполнено(БазовыйАдресAPI) Тогда
		ЗаполнитьБазовыйАдресAPI();
	КонецЕсли;

	МС_HTTPAPIКонструкторСервер.ЗагрузитьКонструкторВТаблицыФормы(Объект, ПоляКонструктора, ОтборыКонструктора);
	ОбновитьСпискиВыбораКонструктора();
	ПредпросмотрИмениТаблицы = МС_HTTPAPIКонструкторСервер.ИмяТаблицыНастройки(Объект);
	ЗаполнитьПараметрыAPIИзОтборовКонструктора();
	МС_HTTPAPIСервер.СинхронизироватьТестовыеЗначенияСПараметрамиЗапроса(Объект);
	ЗагрузитьПараметрыЗаписиJSONВФорму();
	ОбновитьИтоговыйАдресAPI(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБазовыйАдресAPI()

	БазовыйАдрес = МС_HTTPAPIСервер.БазовыйАдресHTTPAPI();
	БазовыйАдресAPI = БазовыйАдрес.Адрес;
	Если Не БазовыйАдрес.АдресПубликацииЗадан Тогда
		Элементы.ИтоговыйАдресAPI.Подсказка =
			"Адрес публикации информационной базы не задан. Укажите его в настройках администрирования
			|(Адрес публикации в локальной сети / в Интернете), тогда здесь отобразится полный адрес API.";
		Элементы.ИтоговыйАдресAPI.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	КонецЕсли;

КонецПроцедуры

// После смены источника: списки выбора, имя таблицы, параметры API из отборов и видимость полей мастера.
&НаСервере
Процедура ОбновитьМастерКонструктора()

	ОбновитьСпискиВыбораКонструктора();
	ПредпросмотрИмениТаблицы = МС_HTTPAPIКонструкторСервер.ИмяТаблицыНастройки(Объект);
	ЗаполнитьПараметрыAPIИзОтборовКонструктора();
	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиВыбораКонструктора()

	ЗаполнитьСписокВыбора(Элементы.КонструкторИмяОбъекта.СписокВыбора,
		МС_HTTPAPIКонструкторСервер.СписокОбъектовПоТипу(Объект.КонструкторТипИсточника));
	ЗаполнитьСписокВыбора(Элементы.КонструкторИмяТабличнойЧасти.СписокВыбора,
		МС_HTTPAPIКонструкторСервер.СписокТабличныхЧастей(Объект.КонструкторТипИсточника, Объект.КонструкторИмяОбъекта));

	ИмяТаблицы = МС_HTTPAPIКонструкторСервер.ИмяТаблицыНастройки(Объект);

	// Срезы есть только у периодических регистров сведений; для других таблиц поле скрыто и очищено.
	ВариантыВиртуальнойТаблицы = МС_HTTPAPIКонструкторСервер.ВариантыВиртуальнойТаблицы(ИмяТаблицы);
	СписокВиртуальныхТаблиц = Элементы.КонструкторВиртуальнаяТаблица.СписокВыбора;
	СписокВиртуальныхТаблиц.Очистить();
	Для Каждого Вариант Из ВариантыВиртуальнойТаблицы Цикл
		СписокВиртуальныхТаблиц.Добавить(Вариант.Значение, Вариант.Представление);
	КонецЦикла;
	Объект.КонструкторВиртуальнаяТаблица = МС_HTTPAPIКонструкторСервер.ВиртуальнаяТаблицаНастройки(Объект, ИмяТаблицы);
	Элементы.КонструкторВиртуальнаяТаблица.Видимость = ВариантыВиртуальнойТаблицы.Количество() > 1;

	ИменаПолейОтборов = Новый Массив;
	Для Каждого СтрокаОтбора Из ОтборыКонструктора Цикл
		ИменаПолейОтборов.Добавить(СтрокаОтбора.Поле);
	КонецЦикла;
	МС_HTTPAPIКонструкторСервер.ЗаполнитьСписокВыбораПолейОтбора(ИмяТаблицы,
		Элементы.ОтборыКонструктораПоле.СписокВыбора, ИменаПолейОтборов);

	ИменаПолейОтвета = Новый Массив;
	Для Каждого СтрокаПоля Из ПоляКонструктора Цикл
		ИменаПолейОтвета.Добавить(СтрокаПоля.ИмяПоля);
	КонецЦикла;
	МС_HTTPAPIКонструкторСервер.ЗаполнитьСписокВыбораПолейОтбора(ИмяТаблицы,
		Элементы.ПоляКонструктораИмяПоля.СписокВыбора, ИменаПолейОтвета);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбора(СписокВыбора, ЭлементыСписка)

	СписокВыбора.Очистить();
	Для Каждого Элемент Из ЭлементыСписка Цикл
		СписокВыбора.Добавить(Элемент.Имя, Элемент.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСравненияОтбора()

	СписокВыбора = Элементы.ОтборыКонструктораСравнение.СписокВыбора;
	СписокВыбора.Очистить();
	Для Каждого Сравнение Из СтрРазделить("=,<>,>,<,>=,<=,ПОДОБНО", ",") Цикл
		СписокВыбора.Добавить(Сравнение);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораФорматаПоля()

	СписокВыбора = Элементы.ПоляКонструктораФормат.СписокВыбора;
	СписокВыбора.Очистить();
	Для Каждого Вариант Из МС_HTTPAPIКонструкторСервер.ВариантыФорматаЗначенияПоля() Цикл
		СписокВыбора.Добавить(Вариант.Значение, Вариант.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыAPIИзОтборовКонструктора()

	Если Объект.СпособПолученияДанных = Перечисления.МС_СпособПолученияДанныхAPI.Конструктор Тогда
		МС_HTTPAPIСервер.ЗаполнитьПараметрыЗапросаИзТаблицыОтборовКонструктора(Объект, ОтборыКонструктора);
		ОбновитьИтоговыйАдресAPI(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Функция НастройкаЗаписана(ТекстПредупреждения)

	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
Функция ТестВыполненияНаСервере(Знач СсылкаНастройки)

	Возврат МС_HTTPAPIСервер.ВыполнитьНастройкуВТестовомРежиме(СсылкаНастройки);

КонецФункции

&НаСервереБезКонтекста
Функция СформироватьПримерНаСервере(Знач СсылкаНастройки)

	Возврат МС_HTTPAPIСервер.СформироватьПримерОтвета(СсылкаНастройки);

КонецФункции

&НаСервере
Процедура КонструкторЗаполнитьПоляИзМетаданныхНаСервере()

	МС_HTTPAPIКонструкторСервер.ЗаполнитьТаблицуПолейПоМетаданным(
		МС_HTTPAPIКонструкторСервер.ИмяТаблицыНастройки(Объект), ПоляКонструктора, Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыИзТекстаЗапросаНаСервере()

	МС_HTTPAPIСервер.ЗаполнитьПараметрыЗапросаИзТекстаЗапроса(Объект);
	ОбновитьИтоговыйАдресAPI(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрыИзОтборовКонструктораНаСервере()

	Если Объект.СпособПолученияДанных <> Перечисления.МС_СпособПолученияДанныхAPI.Конструктор Тогда
		Возврат "";
	КонецЕсли;

	ЗаполнитьПараметрыAPIИзОтборовКонструктора();
	Если Объект.ПараметрыЗапроса.Количество() = 0 Тогда
		Возврат "В отборах нет строк с заполненным ""Параметр запроса"". "
			+ "Такие строки нужны, чтобы передать значение отбора из вызова API (query или тело). "
			+ "Значение в колонке ""Фиксированное значение"" задает постоянный отбор без параметра - "
			+ "оно не попадает в список ""Параметры запроса"".";
	КонецЕсли;

	Возврат "";

КонецФункции

&НаСервереБезКонтекста
Функция ДанныеВводаЗначенияОтбора(Знач ИмяТаблицы, Знач Поле, Знач ЗначениеВнутр, Знач ЗначениеКонстанты)

	ОписаниеТипов = МС_HTTPAPIКонструкторСервер.ПолучитьОписаниеТипаПоляТаблицы(ИмяТаблицы, Поле);
	Если ОписаниеТипов.Типы().Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ЗначениеСтрокой = СокрЛП(ЗначениеКонстанты);
	Отбор = Новый Структура("Поле, ЗначениеВнутр, Значение", Поле, ЗначениеВнутр,
		?(ЗначениеЗаполнено(ЗначениеСтрокой), ЗначениеСтрокой, Неопределено));
	НачальноеЗначение = Неопределено;
	Если МС_HTTPAPIКонструкторСервер.ЕстьФиксированноеЗначениеОтбора(Отбор) Тогда
		НачальноеЗначение = МС_HTTPAPIКонструкторСервер.ЗначениеФиксированногоОтбора(Отбор, ИмяТаблицы);
	КонецЕсли;

	Возврат Новый Структура("ОписаниеТипов, НачальноеЗначение", ОписаниеТипов, НачальноеЗначение);

КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыДляФорматаПоля(Знач ИмяТаблицы, Знач ИмяПоля)

	Возврат МС_HTTPAPIКонструкторСервер.РеквизитыДляФорматаПоля(ИмяТаблицы, ИмяПоля);

КонецФункции

&НаСервереБезКонтекста
Функция ДанныеФиксированногоЗначенияОтбора(Знач Значение)

	Возврат МС_HTTPAPIКонструкторСервер.ДанныеФиксированногоЗначенияОтбора(Значение);

КонецФункции

#КонецОбласти

#Область ПараметрыЗаписиJSON

&НаСервере
Процедура ЗаполнитьСпискиВыбораПараметровЗаписиJSON()

	ЗаполнитьСписокВыбораСтрок(Элементы.ЗаписьJSON_ПереносСтрок.СписокВыбора, "Авто,Нет,Unix,Windows");
	ЗаполнитьСписокВыбораСтрок(Элементы.ЗаписьJSON_ЭкранированиеСимволов.СписокВыбора,
		"Нет,СимволыВнеASCII,СимволыВнеBMP");

	СписокФорматовДаты = Элементы.ЗаписьJSON_ФорматДаты.СписокВыбора;
	СписокФорматовДаты.Очистить();
	Для Каждого Вариант Из МС_HTTPAPIСервер.ВариантыФорматаДатыJSON() Цикл
		СписокФорматовДаты.Добавить(Вариант.Значение, Вариант.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораСтрок(СписокВыбора, Знач Значения)

	СписокВыбора.Очистить();
	Для Каждого Значение Из СтрРазделить(Значения, ",") Цикл
		СписокВыбора.Добавить(Значение);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыЗаписиJSONВФорму()

	Настройки = МС_HTTPAPIСервер.НастройкиЗаписиJSONВСтруктуруФормы(Объект.JSONПараметрыЗаписи);
	Для Каждого КлючИЗначение Из Настройки Цикл
		ЭтотОбъект["ЗаписьJSON_" + КлючИЗначение.Ключ] = КлючИЗначение.Значение;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция НастройкиЗаписиJSONФормы()

	Настройки = Новый Структура;
	Для Каждого КлючИЗначение Из МС_HTTPAPIСервер.НастройкиЗаписиJSONВСтруктуруФормы("") Цикл
		Настройки.Вставить(КлючИЗначение.Ключ, ЭтотОбъект["ЗаписьJSON_" + КлючИЗначение.Ключ]);
	КонецЦикла;

	Возврат Настройки;

КонецФункции

#КонецОбласти

#Область УправлениеИнтерфейсом

// Видимость элементов по способу получения данных, источнику конструктора и формату ответа.
// Элементы способа лежат на страницах без отображения: показывается страница "Группа" + имя способа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента настройки API.
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;

	Способ = Объект.СпособПолученияДанных;
	ЭтоТекстЗапроса = (Способ = ПредопределенноеЗначение("Перечисление.МС_СпособПолученияДанныхAPI.ТекстЗапроса"));
	ЭтоПрограммный = (Способ = ПредопределенноеЗначение("Перечисление.МС_СпособПолученияДанныхAPI.ПрограммныйМодуль"));
	ЭтоКонструктор = Не ЭтоТекстЗапроса И Не ЭтоПрограммный;

	Если ЭтоТекстЗапроса Тогда
		Элементы.ГруппаСпособыПолученияДанных.ТекущаяСтраница = Элементы.ГруппаТекстЗапроса;
	ИначеЕсли ЭтоПрограммный Тогда
		Элементы.ГруппаСпособыПолученияДанных.ТекущаяСтраница = Элементы.ГруппаПрограммныйМодуль;
	Иначе
		Элементы.ГруппаСпособыПолученияДанных.ТекущаяСтраница = Элементы.ГруппаКонструктор;
	КонецЕсли;

	// Элементы способа вне страниц: команды и колонки параметров API, лимит строк.
	Элементы.ПараметрыЗапросаЗаполнитьИзТекста.Видимость = ЭтоТекстЗапроса;
	Элементы.ПараметрыЗапросаЗаполнитьИзОтборов.Видимость = ЭтоКонструктор;
	Элементы.ПараметрыЗапросаИсточник.Видимость = ЭтоПрограммный;
	Элементы.ЛимитСтрок.Видимость = Не ЭтоПрограммный;
	// В конструкторе параметры API формируются из отборов.
	Элементы.ПараметрыЗапросаИмяПараметра.ТолькоПросмотр = ЭтоКонструктор;
	Элементы.ПараметрыЗапросаТипПараметра.ТолькоПросмотр = ЭтоКонструктор;

	ТипИсточника = Объект.КонструкторТипИсточника;
	Элементы.КонструкторИмяТабличнойЧасти.Видимость =
		ТипИсточника = ПредопределенноеЗначение("Перечисление.МС_ТипИсточникаКонструктораAPI.Справочник")
		Или ТипИсточника = ПредопределенноеЗначение("Перечисление.МС_ТипИсточникаКонструктораAPI.Документ");
	Элементы.КонструкторПараметрПериода.Видимость = ЗначениеЗаполнено(Объект.КонструкторВиртуальнаяТаблица);

	Элементы.ГруппаПараметрыЗаписиJSON.Видимость =
		(Объект.ФорматОтвета = ПредопределенноеЗначение("Перечисление.МС_ФорматОтветаAPI.JSON"));

КонецПроцедуры

// Адрес вызова: базовый адрес сервиса + /{Версия}/{ПараметрURL}.
// Для методов без тела (GET, HEAD, DELETE, OPTIONS) параметры запроса добавляются в строку запроса
// со значениями из "Тестовые значения параметров"; для POST, PUT, PATCH параметры передаются в теле.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента настройки API.
//
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоговыйАдресAPI(Форма)

	Адрес = Форма.БазовыйАдресAPI
		+ "/" + ?(ЗначениеЗаполнено(Форма.Объект.ВерсияAPI), СокрЛП(Форма.Объект.ВерсияAPI), "<версия>")
		+ "/" + ?(ЗначениеЗаполнено(Форма.Объект.ПараметрURL), СокрЛП(Форма.Объект.ПараметрURL), "<параметр URL>");

	ПараметрыВТеле = Форма.Объект.HTTPМетод = ПредопределенноеЗначение("Перечисление.МС_HTTPМетодAPI.POST")
		Или Форма.Объект.HTTPМетод = ПредопределенноеЗначение("Перечисление.МС_HTTPМетодAPI.PUT")
		Или Форма.Объект.HTTPМетод = ПредопределенноеЗначение("Перечисление.МС_HTTPМетодAPI.PATCH");

	Если Не ПараметрыВТеле Тогда
		ЧастиЗапроса = Новый Массив;
		Для Каждого СтрокаПараметра Из Форма.Объект.ПараметрыЗапроса Цикл
			Имя = СокрЛП(СтрокаПараметра.ИмяПараметра);
			Если Не ЗначениеЗаполнено(Имя) Тогда
				Продолжить;
			КонецЕсли;
			Значение = "";
			Отбор = Новый Структура("ИмяПараметра", Имя);
			Для Каждого СтрокаТеста Из Форма.Объект.ТестовыеЗначенияПараметров.НайтиСтроки(Отбор) Цикл
				Значение = СтрокаТеста.Значение;
			КонецЦикла;
			ЧастьЗапроса = КодироватьКомпонентURL(Имя) + "=" + КодироватьКомпонентURL(Значение);
			ЧастиЗапроса.Добавить(ЧастьЗапроса);
		КонецЦикла;
		Если ЧастиЗапроса.Количество() > 0 Тогда
			Адрес = Адрес + "?" + СтрСоединить(ЧастиЗапроса, "&");
		КонецЕсли;
	КонецЕсли;

	Форма.ИтоговыйАдресAPI = Адрес;

КонецПроцедуры

// Кодирует служебные символы адреса. КодироватьСтроку на клиенте недоступна;
// кириллицу и прочие символы браузер и HTTP-клиенты кодируют сами.
//
// Параметры:
//  Значение - Строка - имя или значение параметра запроса.
//
// Возвращаемое значение:
//  Строка - значение для строки запроса.
//
&НаКлиентеНаСервереБезКонтекста
Функция КодироватьКомпонентURL(Знач Значение)

	Результат = СтрЗаменить(Значение, "%", "%25");
	Замены = Новый Соответствие;
	Замены.Вставить(" ", "%20");
	Замены.Вставить("&", "%26");
	Замены.Вставить("=", "%3D");
	Замены.Вставить("#", "%23");
	Замены.Вставить("+", "%2B");
	Замены.Вставить("?", "%3F");
	Для Каждого Замена Из Замены Цикл
		Результат = СтрЗаменить(Результат, Замена.Ключ, Замена.Значение);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти
